app/Services/UserService.php

select * from "users" where "mobile_no" = '8583035693' and "login_otp" = '123456' and "is_active" = 1 limit 1
---
    public function findbyMobileandOtp(string $mobile_no,string $otp): ?User
    {
        return User::where('mobile_no',$mobile_no)->where('login_otp',$otp)->where('is_active',1)->first();