app/Http/Controllers/AuthenticationController.php

    public function login1Post(Login1Request $request)
    {
        $userData = $request->validated();
        $userObj = $this->userService->findbyMobileandOtp($userData['mobile_no'], $userData['login_otp']);
        if (is_null($userObj)) {
            $valid = 0;
            return back()->withErrors(['mobile_no' => [__('messages.mobilenonotregister')]]);
        }
        $user = User::where('id', $userObj->id)->where('is_active', 1)->first();
---
select * from "users" where "id" = 1 and "is_active" = 1 limit 1