app/Http/Controllers/LakkhiBhandarWCDformController.php

select * from "m_ds_phase" where "is_current" = 1 limit 1
---
    public function __construct()
    {
        $this->middleware('auth');
        date_default_timezone_set('Asia/Kolkata');
        $phaseArr = DsPhase::where('is_current', TRUE)->first();

select * from "m_ds_phase" order by "phase_code" desc
---
    public function applicantList(Request $request)
    {
        // dd('ok');
        if (is_null($request->list_type)) {
            return redirect("/")->with('error', 'Undefine Report');
        }
        $list_type = $request->list_type;
        if (!in_array($list_type, array(1, 2, 3))) {
            return redirect("/")->with('error', 'Undefine Report');
        }

        $ds_phase_list = DsPhase::orderBy('phase_code', 'DESC')->get();